#用三個雙引號或單引號 可以打多行字串
a = '''
 __  __     ______     __         __         ______        __     __     ______     ______     __         _____    
/\ \_\ \   /\  ___\   /\ \       /\ \       /\  __ \      /\ \  _ \ \   /\  __ \   /\  == \   /\ \       /\  __-.  
\ \  __ \  \ \  __\   \ \ \____  \ \ \____  \ \ \/\ \     \ \ \/ ".\ \  \ \ \/\ \  \ \  __<   \ \ \____  \ \ \/\ \ 
 \ \_\ \_\  \ \_____\  \ \_____\  \ \_____\  \ \_____\     \ \__/".~\_\  \ \_____\  \ \_\ \_\  \ \_____\  \ \____- 
  \/_/\/_/   \/_____/   \/_____/   \/_____/   \/_____/      \/_/   \/_/   \/_____/   \/_/ /_/   \/_____/   \/____/ 

'''
print(a)

a="A394738847347"
print(a[0]) #取該字串的第0位數字
print("長度",len(a))
print('A' in a)
print('B' in a)
# a="!@#ABCabc"
# 密碼="aaa"

#in 練習
txt="The best things in life are free!"
if "free" in txt:
    print("Yes,'free'是字串裡的文字")
else:
    print("No!'free'不是字串裡的文字")

#not in 練習
txt="ABCD"
if "D" not in txt:
    print("D不是字串裡的文字")
else:
    print("D是字串裡的文字")

print("----------------------------")

#for應用方式
for a in txt:
    print(a)

